[["0",{"pageContent":"ID: 0\nMICROCONTROLER: ARDUINO\nCOMPONENT: LED\nHow to wire?: Plug the shorter leg of the LED to a hole on the breadboard. Connect that leg to a GND pin of the Arduino. Plug the longer leg of the LED to a different hole, on a different and independent line of the breadboard. Add a 220 Ohm resistor between this longer leg and a digital pin of the Arduino.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["1",{"pageContent":"ID: 1\nMICROCONTROLER: ARDUINO\nCOMPONENT: Resistor\nHow to wire?: Resistors can be connected between the Arduino's digital pins and ground or to analog pins to modify voltage levels.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["2",{"pageContent":"ID: 2\nMICROCONTROLER: ARDUINO\nCOMPONENT: Pushbutton\nHow to wire?: Plug the push button in the middle of the breadboard. On one button’s leg connect to a GND pin on the Arduino board. The top left and bottom left legs of the button are connected together, and the top right and bottom right legs are connected together. If you have plugged the GND wire on the left side, then plug another wire on the right side, so they are not connected together. This other wire goes to a digital pin, for example 4.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["3",{"pageContent":"ID: 3\nMICROCONTROLER: ARDUINO\nCOMPONENT: Joystick\nHow to wire?: Joystick has 5 pins. GND pin needs to be connected to GND (0V). VCC pin needs to be connected to VCC (5V). VRX pin outputs an analog value corresponding to the horizontal position (called X-coordinate) and should be connected to pin A0. VRY pin  outputs an analog value corresponding to the vertical position (called Y-coordinate) and should be connected to pin A1. SW pin is the output from the pushbutton inside the joystick. It’s normally open. If we use a pull-up resistor in this pin, the SW pin will be HIGH when it is not press and LOW when it is pressed.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["4",{"pageContent":"ID: 4\nMICROCONTROLER: ARDUINO\nCOMPONENT: Buzzer\nHow to wire?: Connect the Supply wire (RED) of the buzzer to the Digital Pin 9 of the Arduino through a 100 ohm resistor. Connect the Ground wire (BLACK) of the buzzer to any Ground Pin on the Arduino.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["5",{"pageContent":"ID: 5\nMICROCONTROLER: ARDUINO\nCOMPONENT: Potentiometer\nHow to wire?: Connect the Potentiometer + Pin to 5V. Connect the Potentiometer - Pin to GND. Connect the Potentiometer Data Pin to A3.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["6",{"pageContent":"ID: 6\nMICROCONTROLER: ARDUINO\nCOMPONENT: Photoresistor (LDR)\nHow to wire?: First, you need to connect the LDR to the analog input pin 0 on the Arduino. You have to use a voltage divider configuration to do this. One leg of the LDR is connected to VCC (5V) on the Arduino, and the other to the analog pin 0 on the Arduino. A 100K resistor is also connected to the same leg and grounded.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["7",{"pageContent":"ID: 7\nMICROCONTROLER: ARDUINO\nCOMPONENT: 7-segment displays\nHow to wire?: Connect the pins described below: Arduino Pin 2 to Pin 9. Arduino Pin 3 to Pin 10. Arduino Pin 4 to Pin 4. Arduino Pin 5 to Pin 2. Arduino Pin 6 to Pin 1. Arduino Pin 8 to Pin 7. Arduino Pin 9 to Pin 6. GND to Pin 3 and Pin 8 each connected with 220 ohm resistors.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["8",{"pageContent":"ID: 8\nMICROCONTROLER: ARDUINO\nCOMPONENT: SEN18 Water Sensor","metadata":{"loc":{"lines":{"from":1,"to":3}}}}],["9",{"pageContent":"How to wire?: S (Signal) is an analog output pin that will be connected to one of your Arduino’s analog inputs. + (VCC) pin provides power to the sensor. It is recommended that the sensor be powered from 3.3V to 5V. Please keep in mind that the analog output will vary depending on the voltage supplied to the sensor. – (GND) is the ground pin. To begin, connect the + (VCC) pin on the module to 5V on the Arduino and the – (GND) pin to ground. One well-known issue with these sensors is that they have a shorter lifespan because they are constantly exposed to moisture. Moreover, constantly applying power to the sensor while immersed in water significantly accelerates the rate of corrosion. To avoid this, it is recommended that the sensor be turned on only when taking readings. One easy way to do this is to connect the sensor’s power pin to a digital pin on an Arduino and set it to HIGH or LOW as needed. So, we’ll connect the + (VCC) pin to the Arduino’s digital pin #7. Finally, connect the","metadata":{"loc":{"lines":{"from":4,"to":4}}}}],["10",{"pageContent":"as needed. So, we’ll connect the + (VCC) pin to the Arduino’s digital pin #7. Finally, connect the S (Signal) pin to the Arduino’s A0 ADC pin.","metadata":{"loc":{"lines":{"from":4,"to":4}}}}],["11",{"pageContent":"__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":5,"to":8}}}}],["12",{"pageContent":"ID: 9\nMICROCONTROLER: ARDUINO\nCOMPONENT: Liquid Crystal Display (LCD)\nHow to wire?: To wire your LCD screen to your board, connect the following pins: LCD RS pin to digital pin 12. LCD Enable pin to digital pin 11. LCD D4 pin to digital pin 5. LCD D5 pin to digital pin 4. LCD D6 pin to digital pin 3. LCD D7 pin to digital pin 2. LCD R/W pin to GND. LCD VSS pin to GND. LCD VCC pin to 5V. LCD LED+ to 5V through a 220 ohm resistor. LCD LED- to GND. Additionally, wire a 10k potentiometer to +5V and GND, with it's wiper (output) to LCD screens VO pin (pin3).\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["13",{"pageContent":"ID: 10\nMICROCONTROLER: ARDUINO\nCOMPONENT: SSD1306 OLED I2C display\nHow to wire?: If you are using an Arduino UNO or an Arduino Nano connect VCC to 5V, GND to GND, SDA to pin A4 and SCL to pin A5. If you are not using an Arduino UNO the SDA and SCL connections might be on different pins.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["14",{"pageContent":"ID: 11\nMICROCONTROLER: ARDUINO\nCOMPONENT: Relay\nHow to wire?: Connect an Arduino Ground Pin to the Ground Pin of your relay. Connect the Arduino 5V pin to the Relay's middle pin.  Connect Pin 13 to the Relay's Signal pin.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["15",{"pageContent":"ID: 12\nMICROCONTROLER: ARDUINO\nCOMPONENT: Servo motor\nHow to wire?: Connect the servo's signal wire to a digital output pin, VCC to 5V, and GND to GND.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["16",{"pageContent":"ID: 13\nMICROCONTROLER: ARDUINO\nCOMPONENT: HC-SR04 Ultrasonic Sensor\nHow to wire?: Connections are very simple: VCC to 5V. GND to GND. Trig to pin 9. Echo to pin 10. You can actually connect Trig and Echo to whichever digital pins you want, 9 and 10 are just the ones I'm using.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["17",{"pageContent":"ID: 14\nMICROCONTROLER: ARDUINO\nCOMPONENT: DHT11 Temperature and Humidity Sensor\nHow to wire?: DHT11 pin-1 is connected to 5v power supply pin on Arduino. DHT11 pin-2 is connected to digital pin-A0 on Arduino. DHT11 pin-3 is NC (not connected). DHT11 pin-4 is connected to GND (Ground) pin on Arduino.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["18",{"pageContent":"ID: 15\nMICROCONTROLER: ARDUINO\nCOMPONENT: Micro SD Card Module\nHow to wire?: This module uses the standard SPI interface for communication. Connect VCC with 5V in the Arduino. Then, connect the GND of SD card to the GND of Arduino. Connect CS to pin 14. Connect SCK to pin 13. MOSI connect to the pin 11. Lastly, connect MISO to pin 12.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["19",{"pageContent":"ID: 16\nMICROCONTROLER: ARDUINO\nCOMPONENT: NRF24L01 Wireless Transceiver\nHow to wire?: This module uses the standard SPI interface for communication. These are configurations for Arduino Nano and Arduino UNO. MISO connects to pin 12. MOSI connects to pin 11. SCK connects to pin 13. CE connects to pin 9. CSN connects to pin 10. GND connects to GND. VCC is connected to 3.3V.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["20",{"pageContent":"ID: 17\nMICROCONTROLER: ARDUINO\nCOMPONENT: L298N Motor Driver\nHow to wire?: Firstly, Connect your Motors with L298n Motor Driver. Then connect your L298n Pins with Arduino Pins: Connect L298n (+5V) pin to the Arduino 5V pin. Connect L298n (Gnd) pin to the Arduino GND pin. Then connect Battery: Connect L298n (+12V) pin to Battery (+ve). Connect L298n (Gnd) pin to Battery (-ve).\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["21",{"pageContent":"ID: 18\nMICROCONTROLER: ARDUINO\nCOMPONENT: ILI9341 Display\nHow to wire?: Connect the display using SPI communication. CS pin is connected to Arduino digital pin 8. RST pin is connected to Arduino digital pin 9. D/C pin is connected to Arduino digital pin 10. MOSI pin is connected to Arduino digital pin 11. SCK pin is connected to Arduino digital pin 13. VCC pin is connected to Arduino 5V pin. GND pin is connected to Arduino GND pin. BL (LED) pin is connected to Arduino 5V pin. MISO pin is not connected.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["22",{"pageContent":"ID: 19\nMICROCONTROLER: ARDUINO\nCOMPONENT: MPU6050 Gyroscope and Accelerometer:\nHow to wire?: These are connections for Arduino UNO and Arduino Nano. Connect SCL module pin to A5 pin. Connect SDA module pin to A4 pin. Connect VCC module pin to 5V. Connect GND to GND.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["23",{"pageContent":"ID: 20\nMICROCONTROLER: ARDUINO\nCOMPONENT: Matrix Keypad 4x4\nHow to wire?: The connection is quite straightforward, as the Arduino connections are made in the same order as the keypad connector. Begin by connecting keypad pin 1 to Arduino digital pin 9. And continue doing the same with the subsequent pins (2 to 8, 3 to 7, and so on). The most convenient way to connect everything is to use an 8-pin male-to-male Dupont ribbon cable.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["24",{"pageContent":"ID: 21\nMICROCONTROLER: ARDUINO\nCOMPONENT: PN532 NFC Module\nHow to wire?: Connect using I2C communication. Connect GND (Ground) to GND. Connect VCC to 5V. Connect SDA to A4 pin. Connect SCL to A5 pin.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["25",{"pageContent":"ID: 22\nMICROCONTROLER: ARDUINO\nCOMPONENT: NEO-6M GPS Module\nHow to wire?: Connect the VCC pin to the 5V pin on the arduino. Connect GND to GND. Connect the Tx pin on the module to digital pin 2. Connect the Rx pin on the module to digital pin 3.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["26",{"pageContent":"ID: 23\nMICROCONTROLER: ARDUINO\nCOMPONENT: RC522 RFID Module\nHow to wire?: Connect using SPI communication. These are configurations for Arduino Nano and Arduino UNO. Connect SDA to Arduino pin 10. Connect SCK to Arduino pin 13. Connect MOSI to Arduino pin 11. Connect MISO to Arduino pin 12. IRQ is not connected. RST is connected to pin 9. GND is connected to GND. 3.3V is connected to 3.3V.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["27",{"pageContent":"ID: 24\nMICROCONTROLER: Raspberry Pi Pico\nCOMPONENT: LED\nHow to wire?: Attach the positive leg (the one with the resistor) to GP13. Attach the negative leg to the closest GND pin\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["28",{"pageContent":"ID: 25\nMICROCONTROLER: Raspberry Pi Pico\nCOMPONENT: Resistor\nHow to wire?: Resistors can be connected between GPIO pins and ground or between GPIO pins to modify voltage levels as needed.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["29",{"pageContent":"ID: 26\nMICROCONTROLER: Raspberry Pi Pico\nCOMPONENT: Pushbutton\nHow to wire?: Connect one end of the pushbutton to a GPIO pin on the Raspberry Pi Pico and the other end to ground (GND). Use a pull-up or pull-down resistor to maintain the input state.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["30",{"pageContent":"ID: 27\nMICROCONTROLER: Raspberry Pi Pico\nCOMPONENT: Joystick\nHow to wire?: Wire the joystick’s 5 pins to the Pico as follows: Connect GND to GND (Any GND pin). Connect +5V to 3V3 Out (physical pin 36). Yes, a 5V joystick will work with the 3V3 power of Pico. Connect VRx to GP27 / ADC1 (physical pin 32). Connect VRy to GP26 / ADC0 (physical pin 31). Connect SW to GP16 (physical pin 21). This would work with most of the GPIo pins.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["31",{"pageContent":"ID: 28\nMICROCONTROLER: Raspberry Pi Pico\nCOMPONENT: Buzzer\nHow to wire?: Connect Connect the longer end (+) of the buzzer to GP11 (=GPIO 11). Connect the shorter end (-) of the buzzer to a GND (ground) pin.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["32",{"pageContent":"ID: 29\nMICROCONTROLER: Raspberry Pi Pico\nCOMPONENT: Potentiometer\nHow to wire?: Connect the labelled with a small 1 to the GND pin between GP21 and GP22. Connect the middle pin the GP26_A0. This is an analogue pin. Connect pin labelled with a small 3 to the 3V3 pin.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["33",{"pageContent":"ID: 30\nMICROCONTROLER: Raspberry Pi Pico\nCOMPONENT: Photoresistor (LDR)\nHow to wire?: Connect one end of the LDR to GP27 (=GPIO 27 or ADC1). Connect the other to GND through a resistor to form a voltage divider.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["34",{"pageContent":"ID: 31\nMICROCONTROLER: Raspberry Pi Pico\nCOMPONENT: 7-Segment Display\nHow to wire?: Connect the following pins from the 7-segment display to the Raspberry Pi Pico: VCC pin to 3V3. GND pin to GND. CLK pin to GP16 on the Pico (last pin on the right side). DIO pin to GP17 on the Pico (next-to-last pin on the right side).\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["35",{"pageContent":"ID: 32\nMICROCONTROLER: Raspberry Pi Pico\nCOMPONENT: Liquid Crystal Display (LCD) I2C\nHow to wire?: Connect SDA to I2C0 SDA (GP0, Physical pin 1). Connect SCK / SCL to I2C0 SCL (GP1, Physical pin 2).  Connect VDD / VCC to VBUS on the Pico. Warning this is a 5V pin. Connect GND to GND.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["36",{"pageContent":"ID: 33\nMICROCONTROLER: Raspberry Pi Pico\nCOMPONENT: SSD1306 OLED display\nHow to wire?: The SDA pin of the OLED Display Module is connected to the GPIO16(Pin21). The SCL pin is connected to the GPIO17(Pin22). The VCC pin is connected to the 3.3v on Raspberry Pi Pico. GND is connected to GND.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["37",{"pageContent":"ID: 34\nMICROCONTROLER: Raspberry Pi Pico\nCOMPONENT: Relay\nHow to wire?: Connect Relay IN to Raspberry Pi Pico GPIO 16 pin. Connect VCC to 3.3V pin. Connect GND to GND pin.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["38",{"pageContent":"ID: 35\nMICROCONTROLER: Raspberry Pi Pico\nCOMPONENT: Servo motor\nHow to wire?: Connect Signal Pin of the Servo Motor to GP0 pin. Connect VCC to 3.3V. Connect GND to GND.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["39",{"pageContent":"ID: 36\nMICROCONTROLER: Raspberry Pi Pico\nCOMPONENT: HC-SR04 Ultrasonic Sensor\nHow to wire?: Connect the Trigger pin of the ultrasonic sensor to GPIO pin 3 of the Raspberry Pi Pico.  Connect the Echo pin from the ultrasonic sensor to GPIO pin 2. Connect VCC to 3.3V pin. Connect GND to GND pin.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["40",{"pageContent":"ID: 37\nMICROCONTROLER: Raspberry Pi Pico\nCOMPONENT: DHT11 Temperature and Humidity Sensor\nHow to wire?: Connect data to GPIO28 pin. Connect VCC to 3.3V. Connect GND to GND.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["41",{"pageContent":"ID: 38\nMICROCONTROLER: Raspberry Pi Pico\nCOMPONENT: Micro SD Card Module:\nHow to wire?: This module works on SPI Communication protocol. Connect MISO to GP4 pin. Connect MOSI to GP3 pin. Connect SCK to GP2 pin. Connect CS to GP1 pin. Connect VCC to 3.3V pin. Connect GND to GND pin.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["42",{"pageContent":"ID: 39\nMICROCONTROLER: Raspberry Pi Pico\nCOMPONENT: NRF2401 Wireless Transceiver\nHow to wire?: VCC (nRF24L01) to 3.3V output (Raspberry Pi Pico). GND (nRF24L01) to GND (Raspberry Pi Pico). Connect SCK (nRF24L01) to GP6 (Raspberry Pi Pico) pin. Connect MOSI (nRF24L01) to GP7 (Raspberry Pi Pico) pin. Connect MISO (nRF24L01) to GP4 (Raspberry Pi Pico) pin. IRQ (nRF24L01) is not connected.  Connect CE (nRF24L01) to GP12 (Raspberry Pi Pico) pin. Connect CSN (nRF24L01) to GP5 (Raspberry Pi Pico) pin.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["43",{"pageContent":"ID: 40\nMICROCONTROLER: Raspberry Pi Pico\nCOMPONENT: SEN18 Water Sensor\nHow to wire?: Connect the analog output pin to an ADC pin. Supply VCC and GND with 3.3V and ground, respectively.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["44",{"pageContent":"ID: 41\nMICROCONTROLER: Raspberry\nCOMPONENT: L298N Motor Driver\nHow to wire?: Firstly, Connect your Motors with L298n Motor Driver. Then connect your L298n Pins with Raspberry Pi pico Pins: Connect ENA to GPIO-0 pin. Connect  IN1 to GPIO-1 pin. Connect IN2 to GPIO-2 pin. Connect IN3 to GPIO-3 pin. Connect IN4 to GPIO-4 pin. Connect ENB to GPIO-5 pin.Connect GND to GND. Connect L298N module to Battery as follows: VCC to +Ve(Red terminal). GND to -Ve(Black Terminal).\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["45",{"pageContent":"ID: 42\nMICROCONTROLER: Raspberry\nCOMPONENT: ILI9341 Display\nHow to wire?: Connect the display using SPI communication. Connect VCC to 3.3V pin. Connect GND to GND pin. Connect SCK to SPI0SCK(Pin 4). Connect MISO to SPI0TX (Pin 5). Connect MOSI to SP0RX (Pin 6). Connect  RES (This display doesn´t have a CS Pin) to SPI0CS (Pin7). Connect DC to pin 9. Connect BLK to pin 10.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["46",{"pageContent":"ID: 43\nMICROCONTROLER: Raspberry\nCOMPONENT: MPU6050 Gyroscope and Accelerometer\nHow to wire?: Connect the module using I2C communication. Connect VCC to 3.3V pin. Connect GND to GND pin. Connect SDA to GP0 pin. Connect SCL to GP1 pin.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["47",{"pageContent":"ID: 44\nMICROCONTROLER: Raspberry\nCOMPONENT: Matrix Keypad 4x4\nHow to wire?: Connect 1 to GP1 pin. Connect 2 to GP2 pin. Connect 3 to GP3 pin. Connect 4 to GP4 pin. Connect 5 to GP5 pin. Connect 6 to GP6 pin. Connect 7 to GP7 pin. Connect 8 to GP8 pin.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["48",{"pageContent":"ID: 45\nMICROCONTROLER: Raspberry\nCOMPONENT: PN532 NFC Module\nHow to wire?: Connected using I2C communication. Connect GND to GND pin. Connect VCC to 3.3V pin. Connect SDA to GPIO-3 pin. Connect SCL to GPIO-5 pin.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["49",{"pageContent":"ID: 46\nMICROCONTROLER: Raspberry\nCOMPONENT: RC522 RFID Module\nHow to wire?: Connected using SPI communication. Connect RST to GP0 pin. IRQ not connected. Connect MISO to GP4 pin. Connect MOSI to GP3 pin. Connect SCK to GP2 pin. Connect SDA to GP1 pin. Connect VCC to 3.3V pin. Connect GND to GND pin.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["50",{"pageContent":"ID: 47\nMICROCONTROLER: Raspberry\nCOMPONENT: NEO-6M GPS Module\nHow to wire?: Connect GPS VCC to Pico 3.3V pin for power. Connect GPS GND to Pico GND pin for ground reference. Connect GPS TX to Pico GP5  pin for receiving data. Connect GPS RX to Pico GP4  pin for transmitting data.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["51",{"pageContent":"ID: 48\nMICROCONTROLER: ESP32\nCOMPONENT: LED\nHow to wire?: Connect the longer leg (anode) to a digital GPIO pin on the ESP32 using resistor and the shorter leg (cathode) to a current-limiting resistor and then to ground (GND).\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["52",{"pageContent":"ID: 49\nMICROCONTROLER: ESP32\nCOMPONENT: Resistor\nHow to wire?: Resistors can be connected between GPIO pins and ground or between GPIO pins to modify voltage levels as needed.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["53",{"pageContent":"ID: 50\nMICROCONTROLER: ESP32\nCOMPONENT: Pushbutton\nHow to wire?: Connect one end of the pushbutton to a digital GPIO pin on the ESP32 and the other end to ground (GND). Use a pull-up or pull-down resistor to maintain the input state.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["54",{"pageContent":"ID: 51\nMICROCONTROLER: ESP32\nCOMPONENT: Joystick\nHow to wire?: Connect GND to GND pin. Connect VCC to 3.3V. Connect VRX to GPIO-36 pin. Connect VRY to GPIO-39 pin. Connect SW to GPIO-17 pin.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["55",{"pageContent":"ID: 52\nMICROCONTROLER: ESP32\nCOMPONENT: Buzzer\nHow to wire?: Connect one pin to a digital GPIO pin on the ESP32 for generating sound and the other to ground (GND).\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["56",{"pageContent":"ID: 53\nMICROCONTROLER: ESP32\nCOMPONENT: Potentiometer\nHow to wire?: Connect the VCC to 3.3V or 5V. Connect GND to GND pin. Connect the wiper (middle leg) to an ADC pin ( for example: GPIO-33pin) for reading the variable resistance.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["57",{"pageContent":"ID: 54\nMICROCONTROLER: ESP32\nCOMPONENT: Photoresistor (LDR)\nHow to wire?: Connect one of the pins of the photoresistor to a 10kΩ resistor. Then connect the same end to pin D2 on the ESP32 board. Connect the free-end of the resistor to the GND pin. Then, connect the free-end of the photoresistor to the 3.3V pin.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["58",{"pageContent":"ID: 55\nMICROCONTROLER: ESP32\nCOMPONENT: 7-Segment Displays\nHow to wire?: Connect GND to GND pin. Connect VCC to 5V. Connect SCLK to GPIO-25. Connect RCLK to GPIO-26. Connect DIO to GPIO-27.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["59",{"pageContent":"ID: 56\nMICROCONTROLER: ESP32\nCOMPONENT: Liquid Crystal Display (LCD)\nHow to wire?: Connect the display using I2C communication. Connect GND to GND. Connect VCC to 5V. Connect the SDA pin to the ESP32’s GPIO-21 pin. Connect SCL pin to the ESP32’s GPIO-22 pin.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["60",{"pageContent":"ID: 57\nMICROCONTROLER: ESP32\nCOMPONENT: SSD1306 OLED display\nHow to wire?: Connect the display using I2C communication. Connect GND to GND. Connect VCC to 5V. Connect the SDA pin to the ESP32’s GPIO-21 pin. Connect SCL pin to the ESP32’s GPIO-22 pin.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["61",{"pageContent":"ID: 58\nMICROCONTROLER: ESP32\nCOMPONENT: Relay\nHow to wire?: Connect GND to GND pin. Connect VCC to 5V. Connect IN to GPIO-16 pin.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["62",{"pageContent":"ID: 59\nMICROCONTROLER: ESP32\nCOMPONENT: Servo motor\nHow to wire?: Connect GND to GND pin. Connect VCC to 5V. Connect Signal to digital GPIO pin ( for example GPIO-26 pin).\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["63",{"pageContent":"ID: 60\nMICROCONTROLER: ESP32\nCOMPONENT: HC-SR04 Ultrasonic Sensor\nHow to wire?: Connect GND to GND pin. Connect VCC to 5V. Connect the trigger and echo pins to separate digital GPIO pins. ( for example trigger to GPIO-5 and echo to GPIO-18 pin)\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["64",{"pageContent":"ID: 61\nMICROCONTROLER: ESP32\nCOMPONENT: DHT11 Temperature and Humidity Sensor\nHow to wire?: Connect GND to GND pin. Connect VCC to 3.3V. Connect data pin to any digital GPIO pin ( for example GPIO-4 pin) using 10k Ohm pull-up resistor.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["65",{"pageContent":"ID: 62\nMICROCONTROLER: ESP32\nCOMPONENT: Micro SD Card Module\nHow to wire?: This module works on SPI Communication protocol. Connect MISO to GPIO-13 pin. Connect MOSI to GPIO-12 pin. Connect SCK to GPIO-14 pin. Connect CS to GPIO-27 pin. Connect VCC to 5V pin. Connect GND to GND pin.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["66",{"pageContent":"ID: 63\nMICROCONTROLER: ESP32\nCOMPONENT: NRF2401 Wireless Transceiver\nHow to wire?: Connect GND to GND pin. Connect VCC to VCC 3.3V pin. Connect IRQ to GPIO-17 pin. Connect CE to GPIO-16 pin. Connect MOSI to MOSI (GPIO-23 or GPIO-13 pin). Connect MISO to MISO (GPIO-19 or GPIO-12 pin).  Connect SS to SS (GPIO-15 or GPIO-5 pin).\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["67",{"pageContent":"ID: 64\nMICROCONTROLER: ESP32\nCOMPONENT: ILI9341 Display\nHow to wire?: Connect the display using SPI communication. Connect GND to GND pin. Connect VCC to 3.3V pin. Connect MISO to GPIO-19 pin. Connect MOSI to GPIO-23 pin. Connect SCK to GPIO-18 pin. Connect D/C to GPIO-21 pin. Connect CS to GPIO-22 pin. Connect Reset to GPIO-17 pin.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["68",{"pageContent":"ID: 65\nMICROCONTROLER: ESP32\nCOMPONENT: MPU6050 Gyroscope and Accelerometer\nHow to wire?: Connect the SDA line of MPU6050 to GPIO-7 pin on ESP32. Connect SCL to GPIO-8 pin. Connect  GND to GND pin. Connect VCC to 3V3 pin. The other pins of MPU6050 need not be connected.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["69",{"pageContent":"ID: 66\nMICROCONTROLER: ESP32\nCOMPONENT: Matrix Keypad 4x4\nHow to wire?: Connect each row and column to separate digital GPIO pins ( for example GPIO-2,  GPIO-0,  GPIO-4,  GPIO-16,  GPIO-17,  GPIO-5,  GPIO-18,  GPIO-19 pins).\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["70",{"pageContent":"ID: 67\nMICROCONTROLER: ESP32\nCOMPONENT: PN532 NFC Module\nHow to wire?: This module uses I2C communication. Connect GND to GND pin. Connect VCC to 3.3V pin. Connect SCL to GPIO-22 pin. Connect SDA to GPIO-21 pin.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["71",{"pageContent":"ID: 68\nMICROCONTROLER: ESP32\nCOMPONENT: RC522 RFID Module\nHow to wire?: This module uses SPI communication. Connect GND to GND pin. Connect VCC to 3.3V pin. Connect RST to GPIO-0 pin. Connect MISO to GPIO-19 pin. Connect MOSI to GPIO-23 pin. Connect CSK to GPIO-18 pin. Connect SDA to GPIO-5 pin.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["72",{"pageContent":"ID: 69\nMICROCONTROLER: ESP32\nCOMPONENT: NEO-6M GPS Module\nHow to wire?: This module uses UART communication. Connect GND to GND pin. Connect VCC to 3.3V pin. Connect TX to GPIO-1 pin. Connect RX to GPIO-3 pin.\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["73",{"pageContent":"ID: 70\nMICROCONTROLER: ESP32\nCOMPONENT: SEN18 Water Sensor\nHow to wire?: Connect GND to GND pin. Connect VCC to 3.3V or 5V pin. Connect the Signal pin to an analog pin on ESP32 ( for example GPIO-35 pin).\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}],["74",{"pageContent":"ID: 71\nMICROCONTROLER: ESP32\nCOMPONENT: L298N Motor Driver\nHow to wire?: Connect GPIO-18 pin of the ESP32 board to pin ENA of the L298N module. Connect GPIO-5 pin of the ESP32 board to pin IN1 of the L298N module. Connect GPIO-4 pin of the ESP32 board to pin IN2 of the L298N module. Connect the GND pin of the ESP32 board to the GND pin of the L298N module.  Connect the GND pin of the ESP32 board to the (-) terminal of the 9V battery. Connect the 12V pin of L298N module to the (+) terminal of battery. Connect the two motor terminals to the two pins OUT1 and OUT2 of the L298N module\n__EMPTY: \n__EMPTY_1: \n__EMPTY_2: \n__EMPTY_3:","metadata":{"loc":{"lines":{"from":1,"to":8}}}}]]